[
  {
    "category": "First Party Collection/Use",
    "paragraphs": [
      "We collect information from you when you register on our site, or subscribe to our newsletter. When registering on our site, as appropriate, you may be asked to enter your: name, e-mail address, mailing address or phone number. You may, however, visit our site anonymously. Your account information. You provide your email to create an account or subscribe to our newsletter. If you refuse to provide such information, you may not be able to use the Services properly. When or registering on our site, you may be asked to enter your contact information, such as your name, avatar, gender, address, telephone number and email address. Demographic information. You provide your personal preferences and interests in customer surveys and offers, so that we can improve products and provide better products for customer. We use location-related information to tailor the Services to our users in different regions. Location-related information may be based on device location information (if the user grants approval to collect) or the users IP address."
    ]
  },
  {
    "category": "Third Party Sharing/Collection",
    "paragraphs": [
      "Information obtained from the Google account you use to login to the website, such as your name, birth date, picture, and other details you may have associated with your Google account. Information obtained from the Facebook account you use to login to the website, such as your name, birth date, picture, and other details you may have on your Facebook profile. We do not have any access to Facebook passwords."
    ]
  },
  {
    "category": "Data Security",
    "paragraphs": [
      "We implement a variety of security measures to maintain the safety of your personal information when you place an order or enter, submit, or access your personal information. We offer the use of a secure server. All supplied sensitive/credit information is transmitted via Secure Socket Layer (SSL) technology and then encrypted into our Payment gateway providers database only to be accessible by those authorized with special access rights to such systems, and are required to? Keep the information confidential. After a transaction, your private information (credit cards, social security numbers, financials, etc.) will not be stored on our servers."
    ]
  },
  {
    "category": "User Choice/Control",
    "paragraphs": [
      "We provide users with the ability to manage, change or delete their data. Changing your email, nickname, and more: You can review and change your personal information by logging into your account and visiting your account settings page. Unsubscribe: If at any time you would like to unsubscribe from receiving future emails, we include detailed unsubscription instructions at the bottom of each email. You may also unsubscribe by visiting your account settings page. Deleting your account: If you want to delete your Account, we will enable you to do this in your account settings page. Deleting your Account will entirely remove the content you have published from our systems."
    ]
  },
  {
    "category": "Data Retention",
    "paragraphs": [
      "We store the data until we no longer need it to provide services or until the user's account is deleted, depending on which comes first. This requires specific analysis of the situation and depends on the nature of the data, the reasons for collecting and processing the data, and the related legal or operational retention needs."
    ]
  },
  {
    "category": "Third Party Sharing/Collection",
    "paragraphs": [
      "You can login to our website with your Facebook or Google account. We will obtain Information from the Facebook account or Google account you use to login to the website, such as your name, email, gender, birthday, picture (your Facebook password is collected directly by Facebook without passing through our systems, and we do not have access to it). Because this kind of information can be seen by anyone, you should exercise care in what you choose to submit; make sure everything you submit is something you want to share with everyone."
    ]
  },
  {
    "category": "Third Party Sharing/Collection",
    "paragraphs": [
      "We do not sell, trade, or otherwise transfer to outside parties your personally identifiable information. This does not include trusted third parties who assist us in operating our website, conducting our business, or servicing you, so long as those parties agree to keep this information confidential. We may also release your information when we believe release is appropriate to comply with the law, enforce our site policies, or protect ours or others rights, property, or safety. However, non-personally identifiable visitor information may be provided to other parties for marketing, advertising, or other uses."
    ]
  },
  {
    "category": "International and Specific Audiences",
    "paragraphs": [
      "Because we value your privacy we have taken the necessary precautions to be in compliance with the California Online Privacy Protection Act. We therefore will not distribute your personal information to outside parties without your consent.As part of the California Online Privacy Protection Act, all users of our site may make any changes to their information at anytime by logging into their account and going to"
    ]
  },
  {
    "category": "International and Specific Audiences",
    "paragraphs": [
      "The Services are not directed to or intended for use by minors. Consistent with the requirements of applicable law, if we learn that we have received any information directly from a minor without his or her parents verified consent, we will use that information only to respond directly to that child (or his or her parent or legal guardian) to inform the minor that he or she cannot use the Services and subsequently will delete that information. We are in compliance with the requirements of COPPA (Childrens Online Privacy Protection Act), we do not collect any information from anyone under 13 years of age. Our website, products and services are all directed to people who are at least 13 years old or older."
    ]
  },
  {
    "category": "Policy Change",
    "paragraphs": [
      "If we decide to change our privacy policy, we will update the Privacy Policy modification date at the top. If there are any questions regarding this privacy policy you may contact us using the information below ."
    ]
  },
  {
    "category": "Data Security",
    "paragraphs": [
      "For the purposes of data protection laws and this privacy notice, whichever part of One Retail Group Limited is processing your personal information is the controller of your personal information for that processing of your personal information. This will usually be the part of One Retail Group Limited that you interact with or have a relationship with. Being a controller of your personal information means that we are responsible for deciding how we hold and use your personal information."
    ]
  },
  {
    "category": "First Party Collection/Use",
    "paragraphs": [
      "When you visit the Site, we automatically collect certain information about your device, including information about your web browser, IP address, time zone, and some of the cookies that are installed on your device. Additionally, as you browse the Site, we collect information about the individual web pages or products that you view, what websites or search terms referred you to the Site, and information about how you interact with the Site. We refer to this automatically-collected information as “Device Information."
    ]
  },
  {
    "category": "First Party Collection/Use",
    "paragraphs": [
      "We collect Device Information using the following technologies: Cookies are data files that are placed on your device or computer and often include an anonymous unique identifier. For more information about cookies, and how to disable cookies. Log files track actions occurring on the Site, and collect data including your IP address, browser type, Internet service provider, referring/exit pages, and date/time stamps. Web beacons, tags, and pixels are electronic files used to record information about how you browse the Site. Additionally when you make a purchase or attempt to make a purchase through the Site, we collect certain information from you, including your name, billing address, shipping address, payment information, email address, and phone number. We refer to this information as Order Information. When we talk about Personal Information in this Privacy Policy, we are talking both about Device Information and Order Information."
    ]
  },
  {
    "category": "Third Party Sharing/Collection",
    "paragraphs": [
      "We use the Order Information that we collect generally to fulfill any orders placed through the Site (including processing your payment information, arranging for shipping, and providing you with invoices and/or order confirmations). Additionally, we use this Order Information to: Communicate with you; Screen our orders for potential risk or fraud; and When in line with the preferences you have shared with us, provide you with information or advertising relating to our products or services. We use the Device Information that we collect to help us screen for potential risk and fraud (in particular, your IP address), and more generally to improve and optimize our Site (for example, by generating analytics about how our customers browse and interact with the Site, and to assess the success of our marketing and advertising campaigns)."
    ]
  },
  {
    "category": "Third Party Sharing/Collection",
    "paragraphs": [
      "We share your Personal Information with third parties to help us use your Personal Information, as described above. For example, we use WooCommerce to power our online store. We also use Google Analytics to help us understand how our customers use the Site–you can read more about how Google uses your Personal Information. You can also opt-out of Google Analytics. Finally, we may also share your Personal Information to comply with applicable laws and regulations, to respond to a subpoena, search warrant or other lawful request for information we receive, or to otherwise protect our rights. As described above, we use your Personal Information to provide you with targeted advertisements or marketing communications we believe may be of interest to you. For more information about how targeted advertising works, you can visit the Network Advertising Initiatives NAI educational page. You can opt out of targeted advertising by using the following links: FACEBOOK, GOOGLE, BING. Additionally, you can opt out of some of these services by visiting the Digital Advertising Alliances opt-out portal."
    ]
  },
  {
    "category": "Do Not Track",
    "paragraphs": [
      "Please note that we do not alter our Sites data collection and use practices when we see a Do Not Track signal from your browser."
    ]
  },
  {
    "category": "Data Retention",
    "paragraphs": [
      "When you place an order through the Site, we will maintain your Order Information for our records unless and until you ask us to delete this information."
    ]
  },
  {
    "category": "Data Security",
    "paragraphs": [
      "Your privacy is important to you and to us. So well protect the information you share with us. To protect your privacy, AGPTEK follows different principles in accordance with world-wide practices for customer privacy and data protection. It is important for you to understand how this happens, so please read this Privacy Policy carefully. We will use state-of-the-art security measures to protect your information from unauthorized users. AGPTEK strictly protects the security of your personal information and honors your choices for its intended use. Your personal information is never shared outside the company without your permission, except under conditions explained above. Inside the company, data is stored in password-controlled servers with limited access.\nYou also have a significant role in protecting your information. No one can see or edit your personal information without knowing your user name and password, so do not share these with others."
    ]
  },
  {
    "category": "Third Party Sharing/Collection",
    "paragraphs": [
      "We wont sell or give away your name, mail address, phone number, email address or any other information to anyone."
    ]
  },
  {
    "category": "First Party Collection/Use",
    "paragraphs": [
      "Generally this information is requested when you create a Registration ID on the site or when you download free software, enter a contest, order e-mail newsletters or join a limited-access premium site. As mentioned above, every registered customer has a unique personal profile, which helps us ensure that only you can access your profile. Even if you switch computers, you wont have to re-register – just use your Registration ID to identify yourself."
    ]
  },
  {
    "category": "Policy Change",
    "paragraphs": [
      "By using our services, you agree that we may collect, use and share your information in accordance with this Privacy Policy, as revised from time to time."
    ]
  },
  {
    "category": "User Choice/Control",
    "paragraphs": [
      "We will ask you when we need information that personally identifies you (personal information) or allows us to contact you.  If you choose not to register or provide personal information, you can still use most of agptek.com. But you will not be able to access areas that require registration."
    ]
  },
  {
    "category": "Data Security",
    "paragraphs": [
      "Aibocn.net takes precautions to protect your Personal information. When you submit sensitive information via the website, your information is protected both online and offline. The policy of allowing access to this Personal Information is only to our staffs with a need to know. We also use available technology and encryption, when legally required or when appropriate for your protection, to provide a more secure environment and to reduce the chance of unauthorized access. Personal Information is stored in a secure environment protected by a combination of physical and technical measures. Tape backups are not permitted to leave the premises without prior authorization."
    ]
  },
  {
    "category": "First Party Collection/Use",
    "paragraphs": [
      "Register email, Password (No any other body can get your password include our staffs, it is encrypted!) When you register in our website, we may collect this information: Your name, E-mail address, phone number, Other information if you want to share with us, like birthday etc. When you order in our website, we may collect this information: Register email, Password, Nickname,the date and time, the URL you request, your PayPal email, your PayPal shipping address."
    ]
  },
  {
    "category": "Data Security",
    "paragraphs": [
      "If you upload images to the website, you should avoid uploading images with embedded location data (EXIF GPS) included. Visitors to the website can download and extract any location data from images on the website."
    ]
  },
  {
    "category": "Data Retention",
    "paragraphs": [
      "If you leave a comment, the comment and its metadata are retained indefinitely. This is so we can recognize and approve any follow-up comments automatically instead of holding them in a moderation queue. For users that register on our website (if any), we also store the personal information they provide in their user profile."
    ]
  },
  {
    "category": "User Choice/Control",
    "paragraphs": [
      "All users can see, edit, or delete their personal information at any time (except they cannot change their username)."
    ]
  },
  {
    "category": "Third Party Sharing/Collection",
    "paragraphs": [
      "We may share general information about the use of our site with advertisers, sponsors, content providers and other third parties. However, we do not disclose any personally identifiable information to any third party without your approval. On occasions it may become necessary to release personal information, including if we are required to do so to satisfy a legal obligation. Further, as a necessary adjunct to the proper operation of our website, our staff and technical contractors, who are subject to obligations of confidentiality to A&D Australasia Pty Ltd, may gain access to personal information as part of their service. Information relating to financial transactions, (eg credit card details) are not obtained by A&D Australasia as we utilise a secure third party payments service as provided by Bank SA."
    ]
  },
  {
    "category": "Third Party Sharing/Collection",
    "paragraphs": [
      "We do not sell personal data for any commercial or marketing purposes, have not sold personal information in the preceding 12 months and will not sell personal information. The following are limited circumstances where we may share your personal data with third parties: External vendors, service providers, and technicians who help with our data processing and storage. In connection with a merger or sale of the company and/or parts of its assets, your personal data may be among items sold or transferred. Contractors or plumbers who may assist you in registering your products or purchasing extended warranties, or performing diagnostics or service. Third parties who you have requested information from for purposes of financing or rebate information. We may share with third parties, such as utility companies, deidentified or aggregated consumer information that cannot reasonably identify you. In certain circumstances, we also share and/or are obliged to share your personal data with third parties in accordance with Data Protection Legislation. These third parties include: relevant industry bodies; external professional advisors; law enforcement or government agencies in order to comply with laws or legal process; affiliates, subsidiaries, divisions, and service providers who provide services to us or on our behalf; third parties who assist us in providing our services and to help us understand your use of our products; select third party vendors, business partners and other companies so that they can send promotional materials about goods and services (including special offers or promotions); and others, where it is permitted by law, or where we have your consent."
    ]
  },
  {
    "category": "Data Security",
    "paragraphs": [
      "We operate and use appropriate administrative, technical and physical security measures to protect your personal data. We have in particular taken appropriate security measures to protect personal data about you from accidental or unlawful destruction, loss, alteration, unauthorized disclosure of, or access, to personal data about you. Access is granted on a need-to-know basis to those employees and other people whose roles require them to process personal data about you."
    ]
  },
  {
    "category": "Data Retention",
    "paragraphs": [
      "We will keep personal data about you for as long as it is necessary to fulfill the purposes for which we process it as described above in Section 3, or if we have another lawful basis for retaining the data beyond the period for which it is necessary to serve the original purpose for collecting the data. This may mean that we will retain some information about you for longer than other information. The criteria we use to determine data retention periods for personal data includes the following: Retention in case of queries; we will retain it for a reasonable period after the relationship between us has ceased; Retention in case of claims; we will retain it for the period in which it may be enforced; and Retention in accordance with legal and regulatory requirements; we will consider whether we need to retain any additional period because of a legal or regulatory requirement."
    ]
  },
  {
    "category": "First Party Collection/Use",
    "paragraphs": [
      "The personal data we collect about you helps us provide the best possible support for your products, optimize your use of our websites and mobile applications, and show advertisements to you based on your interests. In addition, we are required to process certain personal data for legal, regulatory, tax and auditing purposes. The personal data we collect, the basis for our processing, and the purposes of our processing, are detailed below. Sometimes, these activities are carried out by third parties (see Sharing of Personal Data section below)."
    ]
  },
  {
    "category": "User Choice/Control",
    "paragraphs": [
      "You are not required to provide all the personal data described below to us; however, if you choose not to do so, we may not be able to offer you certain services and related features. You may provide personal data to us in various ways. The types of personal data we may obtain includes the following: Personal data we process Basis of processing Purpose of processing"
    ]
  },
  {
    "category": "First Party Collection/Use",
    "paragraphs": [
      "How we use your contact information Why We Do This Set up your user account A user account allows you to maintain your wishlist and your cart across devices, view your order history, save your past delivery information, and more. It makes your life easier! (legitimate interests) Send you order updates via email, text message, or Facebook Messenger If there is an issue that prevents us from shipping the items that you ordered, we will contact you to fix the problem (contractual). We will only contact you via email or the channel(s) that you agreed to. Send info about new products, back in stocks, or special offers via email and/or text message We only send marketing messages when you agree to receive them on specific platforms (consent). Detect and prevent fraud We want to catch potential fraud crimes before it can affect you or us (legal obligation / legitimate interests). How we use your payment information Why We Do This Process your order We require your payment info so we can capture your payment for an order. It allows us to fulfill our contractual agreement to send you the products that you ordered (contractual). Detect and prevent fraud We want to catch potential fraud crimes before it can affect you or us (legal obligation / legitimate interests). How we use your browser and network info Why We Do This Display website information relevant to your current country (currency, free shipping threshold, etc.) The IP Address of your computer tells us what country you are located in. We use this to create the best possible website experience for you (legitimate interests). Improve our website experience We strive to offer the best website experience on all devices and browsers (legitimate interests). Protect our data and our website experience We review site visitor information to detect malicious attacks that could affect the speed of our website and/or the security of our data (contractual / legitimate interests). "
    ]
  },
  {
    "category": "Third Party Sharing/Collection",
    "paragraphs": [
      "We have not and will not sell your information to a third party, ever. That would be a direct violation of our promise to keep your data safe and secure. We do, however, share some information with trusted partners help maintain our privacy mission. They fall into a few categories: We need to share information with our shipping partners so they can get your order to the right doorstep. We only work with highly respected delivery services like USPS, FedEx, UPS and DHL and share as little personal information as possible. We use third party payment processing providers in order to take payments securely. This keeps your sensitive credit card and other payment information safe. We do not store your credit card information on our site. We work with credit card reference and fraud detection companies to ensure the safety of our customers and our business from fraud crimes. This allows us to cancel fraudulent orders before the victim is affected. We work with select third parties to improve our website technology and experience. We share limited information only when it is absolutely essential. We work with third party companies for marketing features such as product reviews and email notifications. Any personal information that they use is limited and secure."
    ]
  },
  {
    "category": "Data Retention",
    "paragraphs": [
      "We retain your information as long as it is needed to provide services to you. This can include as long as you maintain a customer account with us or as long as needed to provide our customer support services - if you have a message history with us. There are a few reasons we may retain your information for more or less time than the above-stated scenarios: We are required by law (an existing regulation or one enacted in the future) to retain your information for a longer period or delete it in a shorter period You exercise your right to request that we delete all your information and we do not have existing legal obligations to hold on to it We enter into a legal claim or other proceedings that involve your information. This could include fraud, abuse, terms & conditions violations, or another type of legal dispute. We will then retain your personal information until the proceedings and any appeals have concluded"
    ]
  },
  {
    "category": "International and Specific Audiences",
    "paragraphs": [
      "We will not knowingly collect any information from any person below the age of 13. If you are a parent or guardian and know that your child has provided us with personal information without your consent, please contact us at . We will promptly delete the personal information of anyone under the age of 13."
    ]
  },
  {
    "category": "First Party Collection/Use",
    "paragraphs": [
      "refer to any information relating to an identified or identifiable natural person (‘data subject), i.e., a name, an identification number, location data, and online identifier, etc. refer to the entities that determine the processing purpose and means of personal data. refer to the entities that process personal data for controllers. The personal data of website visitors contained in the website content of customers that receive Wangsus services. When a customer purchases Wangsus content delivery network service, it shall sign an acceleration service contract with Wangsu. In order to achieve the objective of distribution acceleration for the customers website content, optimize transmission efficiency, and improve end users visiting experience, those website contents that contain personal data will be cached or stored on Wangsus servers, and will be transmitted between servers, and finally transmitted to the customer and other end users. The personal data of website visitors may include login information, user name and contact means, payment means and transaction information, personal data related content that are provided by visitors and visitors personal information that is collected by other customers through their websites. The personal data that are contained in Wangsus user access log data. User access log refers to a record of user activities that are conducted via Wangsus content delivery network platform. The personal data in a user access log may include the IP addresses of end users, website visiting activities data with a time stamp and URLs that combine with IP addresses, the browsers that end users use to visit the website, and the duration of visiting. Wangsu also may obtain geographic location information based on the IP addresses and the position of Wangsus servers, and tele-measuring data, i.e. mouse click, travel speed, user proxy, and relevant browser data, etc. The personal data that are included in customers contact information, and the personal information that is collected during visiting of Wangsus websites. Wangsu or Wangsus websites collects and stores the personal data of customers legal representatives, working staff or contact persons, for daily work contact, maintaining customer relationship and better serving customers. A customers personal data may include: the name and ID card no. of the customers websites responsible person, customer contact persons names, posts, work addresses, telephone numbers, e-mail addresses, IP, browsers, cookies, URLs, etc. Regarding the personal data in customers content, namely, end users personal data Wangsus customers collect, process and transfer end users personal data through their own websites, and Wangsu mainly conducts processing of customers website content on behalf of these customers. That what personal data of users that a website ultimately collects, whether it uses the information on its website, and whether such personal data of end users are cached on Wangsus servers and the duration of caching, and whether encrypted network transmission, collection and processing are conducted using the security services that Wangsu provides, are all determined by the customer through its websites functional design and by inputting orders in Wangsus customer service systems. Wangsu will determine the caching means and optimum transmission path of end users personal data based on such necessary parameters as customer setting and network congestion condition."
    ]
  },
  {
    "category": "Third Party Sharing/Collection",
    "paragraphs": [
      "refer to a natural person or legal person, public institutions, administrative agencies or other organizations without a legal person status, other than data subjects, controllers, Wangsu and other data processors that Wangsu introduces after having obtained a consent of the controller."
    ]
  },
  {
    "category": "Data Security",
    "paragraphs": [
      "Wangsu protects customers personal data that customers provide by proper security management measures, and it adopts various security technical measures, including but not limited to SSL encryption, so as to ensure the security of personal data transmission; Wangsu prevents unauthorized access to such information by means of identify verification and access control; Wangsu regularly conducts security assessment and permeation test of the platform, so as to ensure the platforms reliability; Wangsu conducts proper data security assessment for any processing and change of personal data, so as to ensure that relevant laws about data protection and these terms are observed."
    ]
  },
  {
    "category": "First Party Collection/Use",
    "paragraphs": [
      "This policy applies to information we collect: On our website. When we use phone, email, postal mail, text messages, or other forms of electronic communication to communicate with you. Etekcity collects information from those who communicate with us, website visitors, and (together with an application partner) from website visitors that become customers. Etekcity also collects information from its social media pages. We may collect information from individuals that submit information to us using phone, email, live chat, and postal mail, including name, phone number, email address, postal address, and voice or message content. Information Collected from Website Visitors Etekcity collects some categories of information from website visitors automatically, as described in this section. Information Collected from Visitors Generally We may collect the following information about website visitors (on an aggregate or individual basis): Visitors Internet protocol addresses Locations of visitors The MAC address of visitors devices Information from cookies (see Cookie Policy below) Web browser users are using Operating systems used by visitors Key words or search terms used by visitors to find our website How many visitors view the website or specific pages on it Internet activity information showing how visitors view and use our website, including a history of what pages and products they browse, the search terms they put into the website, and what they click on We maintain records of those interested in our company who use the live chat feature on the website to communicate with us. We use Google Analytics, which is a service of Google LLC. Google Analytics allows us to gather the above information about our websites users. Cookies may be automatically used to collect specific information from a computer or mobile device that accesses and navigates through the Etekcity website over time. Information collected by cookies may include information to help improve and customize the content or layout of the website. A cookie is a small text file that websites save on a computers storage device when a website is visited. Cookies cannot be used to run programs or deliver viruses to the computer or mobile device accessing the Etekcity website. Users can establish or change their browser settings to refuse cookies. Nonetheless, refusing cookies may interfere with the full functionality of the website and limit the user experience. Please see our for further details. Information Collected from Users and User Devices Information Collected in Connection with Purchases When purchasing products, we ask customers to provide the following categories of personal information for their account profile on Etekcitys website: First and last name Mobile number Email address A user-selected password Postal address (shipping and billing) Payment information Date of birth"
    ]
  },
  {
    "category": "Third Party Sharing/Collection",
    "paragraphs": [
      "When you post information on our social media pages on one of the social media platforms, we will be able to view the content in your post (e.g., text, photo, audio, or video). We will also be able to view your user name and information that you record on your profile on that platform. Etekcity may share your personal information with the application partner whose mobile application controls your smart device, other affiliates, vendors, or outsource service providers that help us provide products and services to our customers, or that assist with support functions such as marketing, billing, payment card processing, and data analysis. We will require application partners and any other such vendors or service providers to manage your personal information with privacy and security safeguards consistent with this privacy policy. For Etakcity products that interoperate with other devices and systems, you will receive notice when information about you might go to third parties, and you will have an opportunity to choose not to share the information. For example, if you want to use Amazons Alexa, Etekcity or the applicable application partner may notify you before sharing your data with Amazon."
    ]
  },
  {
    "category": "Data Retention",
    "paragraphs": [
      "Etekcity and its application partners will maintain your personal information only as long as it is needed for the purposes described above in this Section 5, such as to complete transactions with you, to complete any applicable investigations, for the duration of any dispute resolution process, or to the extent required to meet preservation requirements under applicable law. Etekcity and its application partners may continue to maintain your personal information for the reasons described in Section below. You may delete your online account with an application partner at any time. After you delete your online account, the application partner will delete the personal information stored in it, including any stored payment information or personal information collected by Etekcity smart devices."
    ]
  },
  {
    "category": "User Choice/Control",
    "paragraphs": [
      "You have the right to request that we delete any of your personal information that we collected from you and retained by us, subject to certain conditions and exceptions under the law. For instance, we have the right to retain personal information needed to: Complete the transaction for which the personal information was collected, provide a good or service requested by the California resident, or reasonably anticipated within the context of our ongoing business relationship with the California resident, or otherwise perform a contract between our business and the California resident. Detect security incidents, protect against malicious, deceptive, fraudulent, or illegal activity; or prosecute those responsible for that activity. Conduct solely internal uses that are reasonably aligned with the expectations of the California resident based on the California residents relationship with us. Comply with a legal obligation. Use the personal information internally, in a lawful manner that is compatible with the context in which the California resident provided it. The identity of any person making such a request must be verified as a condition of deleting the personal information as requested."
    ]
  }
]